In [1]:
# Importing pandas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import numpy as np

attrition = pd.read_feather("../datasets/attrition.feather")
spotify = pd.read_feather("../datasets/spotify_2000_2020.feather")
coffee_ratings = pd.read_feather("../datasets/coffee_ratings_full.feather")

In [2]:
import pandas as pd

In [7]:
###############
x=[i for i in range(100)]
t =pd.DataFrame({})

In [8]:
t['x']=x

In [14]:
    tts1=t.sample(frac=1 , replace=True)

In [15]:
tts1.value_counts

<bound method DataFrame.value_counts of      x
73  73
52  52
49  49
0    0
16  16
..  ..
25  25
17  17
67  67
70  70
71  71

[100 rows x 1 columns]>

In [5]:
t.sample(20)

     x
63  63
82  82
35  35
25  25
39  39
84  84
10  10
18  18
12  12
7    7
19  19
51  51
69  69
44  44
30  30
81  81
94  94
41  41
66  66
26  26

In [6]:
t.sample(frac=0.2)

     x
49  49
72  72
12  12
44  44
65  65
56  56
18  18
45  45
11  11
50  50
38  38
82  82
68  68
83  83
85  85
0    0
4    4
90  90
19  19
25  25

In [9]:
t.sample(frac=0.02)

     x
98  98
23  23

In [10]:
q1 =filter(lambda i: i%5 ==0 ,t['x'])
list(q1)

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

In [11]:
q2= filter(lambda i:i>50 and i%2 ==0 , t.x)
list(q2)

[52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98]

In [13]:
# Sample one to eight, five times, with replacement
five_rolls = np.random.choice(list(range(1, 9)), size=5, replace=True)

# Print the mean of five_rolls
print(five_rolls.mean())

5.8

In [19]:
# Sample one to eight, five times, with replacement
five_rolls = np.random.choice(range(1, 9) ,  size=2)

# Print the mean of five_rolls
print(five_rolls.mean())

5.0